const scheduleWeek = {
    "iceburgarena": {
        "Понедельник": [""],
        "Вторник": ["18.45-19.45 зал", "20.00-21.00 лёд"],
        "Среда": ["18.45 -19.45 зал", "20.00-21.00 лёд"],
        "Четверг": [""],
        "Пятница": [""],
        "Суббота": ["9.00-10.00 лёд", "10.15-11.15 зал"],
        "Воскресенье": ["11.15-12.15 зал", "12.30-13.30 лёд"]
    },
    "ice3": {
        "Понедельник": [
            "Лёд 18:45-19:45 ",
            "Зал 17:30-18:30 ",
            "Зал 20:00-21:00 ",
        ],
        "Вторник": [
            "Лёд 17:30-18:30",
            "Лёд 18:45-19:45",
            "Зал 18:45-19:45",
            "Зал 20:00-21:00"
        ],
        "Среда": [
            "Лёд 18:45-19:45",
            "Зал 17:30-18:30",
        ],
        "Четверг": [
            "Лёд 18:45-19:45",
            "Зал 17:30-18:30",
            "Зал 20:00-21:00"
        ],
        "Пятница": [
            "Лёд 18:45-19:45",
            "Зал 17:30-18:30",
            "Зал 20:00-21:00"
        ],
        "Суббота": [
            "Лёд 11:15-12:15",
            "Лёд 13:45-14:45",
            "Зал 10:00-11:00",
            "Зал 12:30-13:30",
            "Зал 15:00-16:00",
        ],
        "Воскресенье": [""]
    },
    "border": {
        "Понедельник": ["16:15 лед", "17:30 зал", "19:00 лед", "20:00 зал", "19:00 зал", "20:00 лед"],
        "Вторник": ["9:45 зал", "11:00 лед", "19:00 лед", "20:00 зал", "19:00 зал", "20:00 лед"],
        "Среда": ["17:45 лед", "19:00 зал", "19:00 лед", "20:00 зал", "19:00 зал", "20:00 лед"],
        "Четверг": ["9:45 зал", "11:00 лед", "19:00 лед", "20:00 зал", "19:00 зал", "20:00 лед"],
        "Пятница": ["19:00 лед", "20:00 зал", "19:00 зал", "20:00 лед"],
        "Суббота": ["8:45 лед", "10:00 зал", "10:00 лед", "11:15 зал", "11:15 лед", "12:30 зал", "12:30 лед", "13:45 зал", "13:45 лед", "15:00 зал"],
        "Воскресенье": ["9:00 лед", "10:15 зал"]
    },
    "arenachance": {
        "Понедельник": [""],
        "Вторник": ["9:15-10:15 зал", "10:30-11:30 лед", "14:15-15:15 лед", "15:30-16:30 зал"],
        "Среда": ["18:15-19:15 лед", "19:30-20:30 зал"],
        "Четверг": ["9:15-10:15 зал", "10:30-11:30 лед"],
        "Пятница": ["18:15-19:15 лед", "19:30-20:30 зал"],
        "Суббота": ["11:15-12:15 зал", "12:30-13:30 лед", "13:45-14:45 зал", "15:00-16:00 лед"],
        "Воскресенье": [""]
    },
    "arenakharlamova": {
        "Понедельник": ["Лед 18:45-19:45", "Зал 20:00-21:00"],
        "Среда": ["Лед 18:45-19:45", "Зал 20:00-21:00"],
        "Пятница": ["Лед 18:45-19:45", "Зал 20:00-21:00"],
        "Суббота": ["Лед 17:45-18:45", "Зал 19:00-20:00"],
        "Воскресенье": ["Зал 14:30-15:30", "Лед 15:45-16:45"]
    },
    "arenarocket": {
        "Понедельник": [""],
        "Вторник": ["18:15-19:15 зал", "19:30-20:30 лед"],
        "Среда": ["18:15-19:15 зал", "19:30-20:30 лед"],
        "Четверг": [""],
        "Пятница": ["18:15-19:15 зал", "19:30-20:30 лед"],
        "Суббота": ["9:30-10:30 лед", "10:45-11:45 зал", "10:45-11:45 лед", "12:00-13:00 зал"],
        "Воскресенье": [""]
    },
    "strelna": {
        "Понедельник": ["18:45 зал", "20:00 лед"],
        "Вторник": ["18:45 зал", "20:00 лед"],
        "Среда": ["18:45 зал", "20:00 лед"],
        "Четверг": ["18:45 зал", "20:00 лед"],
        "Пятница": ["18:45 зал", "20:00 лед"],
        "Суббота": [""],
        "Воскресенье": [""]
    },
    "petergof": {
        "Понедельник": [""],
        "Вторник": ["18:45 зал", "20:00 лед"],
        "Среда": ["18:45 зал", "20:00 лед"],
        "Четверг": ["18:45 зал", "20:00 лед"],
        "Пятница": ["18:45 зал", "20:00 лед"],
        "Суббота": [""],
        "Воскресенье": [""]
    },
    "redstar": {
        "Понедельник": ["18:30-19:30 лед", "19:45-20:45 зал"],
        "Вторник": [""],
        "Среда": ["18:30-19:30 лед", "19:45-20:45 зал"],
        "Четверг": [""],
        "Пятница": ["18:45-19:45 лед", "20:00-21:00 зал"],
        "Суббота": ["9:15-10:15 лед", "10:30-11:30 зал"],
        "Воскресенье": ["9:30-10:30 лед", "10:45-11:45 зал"]
    },
    "shuvalovskyarena": {
        "Понедельник": ["18.15-19.15 зал", "19.30-20.30 лёд"],
        "Вторник": ["9.30-10.30 лёд", "10.45-11.45 зал", "18.45-19.45 зал", "20.00-21.00 лёд"],
        "Среда": [""],
        "Четверг": ["9.30-10.30 лёд", "10.45-11.45 зал", "17.45-18.45 лёд", "19.00-20.00 зал", "18.45-19.45 зал", "20.00-21.00 лёд"],
        "Пятница": ["18.45-19.45 зал", "20.00-21.00 лёд"],
        "Суббота": ["12.15-13.15 зал", "13.30-14-30 лёд", "14.45-15.45 зал", "16.00-17.00 лёд"],
        "Воскресенье": [""]
    },
    "parnasarena": {
        "Понедельник": ["18:30-19:30 зал", "19:45-20:45 лед"],
        "Вторник": ["17:30-18:30 зал", "18:45-19:45 лед", "20:00-21:00 зал"],
        "Среда": [""],
        "Четверг": ["17:30-18:30 зал", "18:45-19:45 лед", "20:00-21:00 зал"],
        "Пятница": [""],
        "Суббота": ["10:45-11:45 лед", "12:00-13:00 зал", "14:00-15:00 зал", "15:15-16:15 лед"],
        "Воскресенье": [""]
    },
    "repinoarena": {
        "Понедельник": [""],
        "Вторник": ["18:00 зал", "19:15 лед"],
        "Среда": [""],
        "Четверг": ["17:30 лед", "18:45 зал"],
        "Пятница": [""],
        "Суббота": [""],
        "Воскресенье": [""]
    },
    "TEMPLATE": {
        "Понедельник": [""],
        "Вторник": [""],
        "Среда": [""],
        "Четверг": [""],
        "Пятница": [""],
        "Суббота": [""],
        "Воскресенье": [""]
    },
}
const scheduleSeason = {
    "iceburgarena": {
        "Оздоровительные группы": {
            "Дополнительно": "",
            "Глушкова К.В.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        ""
                    ],
                    "Вторник": [
                        "18.45 -19.45 зал",
                        "20.00-21.00 лёд",
                    ],
                    "Среда": [
                        "18.45 -19.45 зал",
                        "20.00-21.00 лёд",
                    ],
                    "Четверг": [
                        ""
                    ],
                    "Пятница": [
                        ""
                    ],
                    "Суббота": [
                        "9.00-10.00 лёд",
                        "10.15-11.15 зал"
                    ],
                    "Воскресенье": [
                        "11.15-12.15 зал",
                        "12.30-13.30 лёд"
                    ],
                },
            },
            "Сластина Е.Л.": {
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "18.45-19.45 зал",
                        "20.00-21.00 лёд",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "Занятия проходят на арене Шуваловский лёд",
                    ],
                    "Воскресенье": [
                        "11.15-12.15 зал",
                        "12.30-13.30 лёд",
                    ],
                },
                "Дополнительно": "(2-3 год обучения)",
            }
        },
        "Группы 2 года обучения": {
            "Дополнительно": "(Новичок 1, Новичок 2)",
            "Махалова А.А.": {
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "18.45 -19.45 зал",
                        "20.00-21.00 лёд",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "9.00-10.00 лёд",
                        "10.15-11.15 зал",
                    ],
                    "Воскресенье": [
                        "11.15-12.15 зал",
                        "12.30-13.30 лёд",
                    ],
                },
                "Дополнительно": "",
            },
            "Кочина А.А.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "Занятия проходят на арене Шуваловский лёд",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "Занятия проходят на арене Шуваловский лёд",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "9.00-10.00 лёд",
                        "10.15-11.15 зал",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
            "Сластина Е.Л.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "18.45 -19.45 зал",
                        "20.00-21.00 лёд",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "Занятия проходят на арене Шуваловский лёд",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "Занятия проходят на арене Шуваловский лёд",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
        "Любители": {
            "Дополнительно": "",
            "Будзько А.А.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "18.45-19.45 зал",
                        "20.00-21.00 лёд",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "9.00-10.00 лёд",
                        "10.15-11.15 зал",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
        "Группа набора": {
            "Дополнительно": "(без подготовки)",
            "Асанова О.О.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "18.45 -19.45 зал",
                        "20.00-21.00 лёд",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "11.15-12.15 зал",
                        "12.30-13.30 лёд",
                    ],
                },
            },
        },
    },
    "ice3": {
        "Оздоровительные группы": {
            "Дополнительно": "",
            "Будзько А.А.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "18:45-19:45 лёд",
                        "20:00-21:00 зал ",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "13:45-14:45 лёд",
                        "15:00-16:00 зал",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
            "Кузнецова В.М.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "17:30-18:30 лед",
                        "18:45-19:45 зал",
                    ],
                    "Среда": [
                        "17:30-18:30 зал",
                        "18:45-19:45 лёд",
                        "20:00-21:00 танцы",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "17:30-18:30 зал",
                        "18:45-19:45 лёд",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
            "Погонина А.А.": {
                "Дополнительно": "(взрослые от 16 лет)",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "13:45-14:45 лёд",
                        "15:00-16:00 зал",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
        "Группа 2 года обучения": {
            "Дополнительно": "(новичок 1, новичок 2)",
            "Зубачева А.Н.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "17:30-18:30 зал",
                        "18:45-19:45 лед",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "10:00-11:00 зал",
                        "11:15-12:15 лёд",
                        "12:30-13:30 хореография",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
            "Попова Е.А.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "17:30-18:30 лёд",
                        "18:45-19:45 лёд",
                        "20:00-21:00 зал",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "17:30-18:30 зал",
                        "18:45-19:45 лед",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "10:00-11:00 зал",
                        "11:15-12:15 лед",
                        "12:30-13:30 хореография",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
            "Погонина А.А.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "17:30-18:30 лёд",
                        "18:45-19:45 зал",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "17:30-18:30 зал",
                        "18:45-19:45 лед",
                    ],
                    "Суббота": [
                        "10:00-11:00 зал",
                        "11:15-12:15 лед",
                        "12:30-13:30 хореография",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
        "Юношеские разряды": {
            "Дополнительно": "",
            "Вязина Е.А. ": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "18:45-19:45 лёд",
                        "20:00-21:00 зал",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "18:45-19:45 лёд",
                        "20:00-21:00 зал",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
        "Группа набора ": {
            "Дополнительно": "",
            "Кочанова С.О.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "17:30-18:30 зал",
                        "18:45-19:45 лед",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "13:45-14:45 лёд",
                        "15:00-16:00 зал",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
            "Зубачова А.Н.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "18:45-19:45 лёд",
                        "20:00-21:00 зал",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "18:45-19:45 лёд",
                        "20:00-21:00 зал",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
    },
    "border": {
        "Спорт. разряды": {
            "Дополнительно": "",
            "Карнизов А.В.": {
                "Дополнительно": "(2016-2014 г.р.)",
                "Расписание": {
                    "Понедельник": [
                        "16:15-17:15 лед ",
                        "17:30-18:30 зал ",
                    ],
                    "Вторник": [
                        "18:45-19:45 хореография",
                        "20:00-21:00 лед",
                    ],
                    "Среда": [
                        "16:15-17:15 зал ",
                        "17:30-18:45 лед (6 раз)",
                    ],
                    "Четверг": [
                        "18:45-19:45 хореография",
                        "20:00-21:00 лед",
                    ],
                    "Пятница": [
                        "17:45-18:45 зал",
                        "19:00-20:00 лед",
                    ],
                    "Суббота": [
                        "8:45-10:00 лед ",
                        "10:15-11:15 зал ",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
            "Ефремова А.И.": {
                "Дополнительно": "(2012-2009 г.р.)",
                "Расписание": {
                    "Понедельник": [
                        "16:15-17:15 лед",
                        "17:30-18:30 зал",
                    ],
                    "Вторник": [
                        "18:45-19:45 хореография",
                        "20:00-21:00 лед",
                    ],
                    "Среда": [
                        "17:30-18:45 лед",
                        "19:00-20:00 зал",
                    ],
                    "Четверг": [
                        "17:45-18:45 зал",
                        "19:00-20:00 лед",
                    ],
                    "Пятница": [
                        "17:45-18:45 зал",
                        "19:00-20:00 лед",
                    ],
                    "Суббота": [
                        "11:15-12:15 лед",
                        "12:30-13:30 хореография",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
            "Серебряникова А.А.": {
                "Дополнительно": "(2016-2007 г.р.)",
                "Расписание": {
                    "Понедельник": [
                        "16:15-17:15 лед",
                        "17:30-18:30 зал",
                    ],
                    "Вторник": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед",
                    ],
                    "Среда": [
                        "17:30-18:30 лед (5 раз)",
                        "18:45-19:45 хореография",
                        "20:00-21:00 лед (4 раза)",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "17:45-18:45 зал",
                        "19:00-20:00 лед",
                        "20:15-21:00 зал",
                    ],
                    "Суббота": [
                        "11:15-12:15 лед (6 раз)",
                        "12:30-13:30 хореография",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
        "Юнош. разряды ": {
            "Дополнительно": "",
            "Глазкова А.О.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "19:00-20:00 лед",
                        "20:15-21:00 зал",
                    ],
                    "Среда": [
                        "18:45-19:45 хореография",
                        "20:00-21:00 лед (4 раз)",
                    ],
                    "Четверг": [
                        "19:00-20:00 лед",
                        "20:15-21:00 зал",
                    ],
                    "Пятница": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
            "Карнизов А.В.": {
                "Дополнительно": "(2017-2016 г.р.)",
                "Расписание": {
                    "Понедельник": [
                        "17:30-18:45 зал",
                        "19:00-20:00 лед",
                    ],
                    "Вторник": [
                        "17:45-18:45 зал",
                        "19:00-20:00 лед",
                    ],
                    "Среда": [
                        "16:15-17:15 зал ",
                        "17:30-18:45 лед (6 раз)",
                    ],
                    "Четверг": [
                        "17:45-18:45 зал",
                        "19:00-20:00 лед",
                    ],
                    "Пятница": [
                        "18:45-19:45 хореография",
                        "20:00-21:00 лед",
                    ],
                    "Суббота": [
                        "11:15-12:15 лед",
                        "12:30-13:30 хореография",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
            "Серебряникова Е.А": {
                "Дополнительно": "(2015-2010 г.р.)",
                "Расписание": {
                    "Понедельник": [
                        "19:00-20:00 лед",
                        "20:15-21:00 зал",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "19:00-20:00 лед",
                        "20:15-21:00 зал",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "18:45-19:45 хореография",
                        "20:00-21:00 лед (4 раз)",
                    ],
                    "Суббота": [
                        "9:00-10:00 лед",
                        "10:15-11:15 зал",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
        "Группа 3 года обучения ": {
            "Дополнительно": "(новичок 3, юный фигурист)",
            "Мушанова Е.А.": {
                "Дополнительно": "(новичок 3, юный фигурист)",
                "Расписание": {
                    "Понедельник": [
                        "18:45-19:45 хореография",
                        "20:00-21:00 лед (4 раз)",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "17:45-18:45 зал",
                        "19:00-20:00 лед",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "17:45-18:45 зал",
                        "19:00-20:00 лед",
                    ],
                    "Суббота": [
                        "8:45-10:00 лед",
                        "10:15-11:15 зал",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
            "Сорокина Е.А.": {
                "Дополнительно": "(новичок 3, юный фигурист)",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "19:00-20:00 лед",
                        "20:15-21:00 зал",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "11:15-12:15 зал",
                        "12:30-13:30 лед",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
        "Группа любителей ": {
            "Дополнительно": "",
            "Онищенко С.А.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "17:45-18:45 зал",
                        "19:00-20:00 лед",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "11:15-12:15 зал",
                        "12:30-13:30 лед",
                        "13:45-14:45 лед",
                        "15:00-16:00 зал",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
            "Борисова С.Н.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "19:00-20:00 лед",
                        "20:15-21:00 зал",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "13:45-14:45 лед",
                        "15:00-16:00 зал",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
            "Степаньков Н.В.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "9:00-9:45 зал",
                        "10:00-11:00 лёд",
                    ],
                },
            },
        },
        "Группа 2 года обучения ": {
            "Дополнительно": "(новичок 1, новичок 2)",
            "Селезенева К.А.": {
                "Дополнительно": "7-10 лет",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
            "Серебряникова А.А / Назарова Е.А.": {
                "Дополнительно": "4-6 лет",
                "Расписание": {
                    "Понедельник": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "(третий раз)",
                        "9:00-9:45 зал",
                        "10:00-11:00 лед",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
            "Мушанова Е.А. (Серебряникова Е.А.)": {
                "Дополнительно": "7-10 лет",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "19:00-20:00 лед",
                        "20:15-21:00 зал",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "11:15-12:15 лед (третий раз)",
                        "12:30-13:30 зал",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
            "Карнизов А.В. / Ефремова А.И.": {
                "Дополнительно": "3-5 лет",
                "Расписание": {
                    "Понедельник": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед (третий раз)",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "12:30-13:30 лед",
                        "13:45-14:45 зал",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
            "Ефремова А.И.": {
                "Дополнительно": "3-5 лет",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "9:45-10:45 зал",
                        "11:00-12:00 лед ",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "9:45-10:45 зал",
                        "11:00-12:00 лед ",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "9:00-9:45 зал",
                        "10:00-11:00 лед",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
        "Группы набора": {
            "Дополнительно": "(без подготовки)",
            "Серебряникова А.А": {
                "Дополнительно": "3-5 лет",
                "Расписание": {
                    "Понедельник": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
            "Назарова Е.А.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "9:45-10:45 зал",
                        "11:00-12:00 лед ",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "9:45-10:45 зал",
                        "11:00-12:00 лед ",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
            "Степаньков Н.В.": {
                "Дополнительно": "5-8 лет",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "12:30-13:30 лед",
                        "13:45-14:45 зал",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
            "Ефремова А.И.": {
                "Дополнительно": "3-5 лет",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лёд",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
    },
    "arenachance": {
        "Спортивные разряды ": {
            "Дополнительно": "",
            "Жунгиету Ю.И.": {
                "Дополнительно": "2016-2014 г.р.",
                "Расписание": {
                    "Вторник": [
                        "14:15-15:15 лед",
                        "15:30-16:30 зал ",
                    ],
                    "Среда": [
                        "18:15-19:15 лед",
                        "19:30-20:30 зал",
                    ],
                    "Пятница": [
                        "18:15-19:15 лед",
                        "19:30-20:30 зал",
                    ],
                    "Суббота": [
                        "11:15-12:15 хореография",
                        "12:30-13:30 лед",
                        "13:45-14:45 зал",
                        "15:00-16:00 лед",
                    ],
                },
            },
        },
        "Юношеские разряды": {
            "Дополнительно": "",
            "Доронина С.И.": {
                "Дополнительно": "",
                "Расписание": {
                    "Среда": [
                        "18:15-19:15 лед",
                        "19:30-20:30 зал",
                    ],
                    "Пятница": [
                        "18:15-19:15 лед",
                        "19:30-20:30 зал",
                    ],
                    "Суббота": [
                        "11:15-12:15 доп. хореография",
                        "12:30-13:30 лед ",
                        "13:45-14:45 зал",
                        "15:00-16:00 лед",
                    ],
                },
            },
            "Калашникова Н.А.": {
                "Дополнительно": "",
                "Расписание": {
                    "Среда": [
                        "18:15-19:15 лед",
                        "19:30-20:30 зал",
                    ],
                    "Пятница": [
                        "18:15-19:15 лед",
                        "19:30-20:30 зал",
                    ],
                    "Суббота": [
                        "11:15-12:15 доп. хореография",
                        "12:30-13:30 лед ",
                        "13:45-14:45 зал",
                        "15:00-16:00 лед",
                    ],
                },
            },
            "Кочина А.А.": {
                "Дополнительно": "",
                "Расписание": {
                    "Вторник": [
                        "18:00-19:00 лед",
                        "19:15-20:15 зал",
                    ],
                    "Четверг": [
                        "18:00-19:00 лед",
                        "19:15-20:15 зал",
                    ],
                    "Суббота": [
                        "13:45-14:45 зал",
                        "15:00-16:00 лед",
                    ],
                },
            },
        },
        "Группа 2 года обучения": {
            "Дополнительно": "(новичок 1, новичок 2)",
            "Цепенкова К.М.": {
                "Дополнительно": "",
                "Расписание": {
                    "Среда": [
                        "18:15-19:15 лед",
                        "19:30-20:30 зал",
                    ],
                    "Суббота": [
                        "11:15-12:15 зал",
                        "12:30-13:30 лед",
                    ],
                },
            },
            "Вершинина В.В.": {
                "Дополнительно": "",
                "Расписание": {
                    "Среда": [
                        "18:15-19:15 лед",
                        "19:30-20:30 зал",
                    ],
                    "Пятница": [
                        "18:15-19:15 лед",
                        "19:30-20:30 зал",
                    ],
                },
            },
            "Жунгиету Ю.И.": {
                "Дополнительно": "",
                "Расписание": {
                    "Вторник": [
                        "9:15-10:15 зал",
                        "10:30-11:30 лед",
                    ],
                    "Четверг": [
                        "9:15-10:15 зал",
                        "10:30-11:30 лед",
                    ],
                },
            },
        },
        "Оздоровительная группа": {
            "Дополнительно": "",
            "Катичев В.О.": {
                "Дополнительно": "",
                "Расписание": {
                    "Суббота": [
                        "13:45-14:45 зал",
                        "15:00-16:00 лед",
                    ],
                },
            },
        },
        "Группа набора": {
            "Дополнительно": "(без подготовки)",
            "Федькина С.О.": {
                "Дополнительно": "Набор 3-6 лет",
                "Расписание": {
                    "Вторник": [
                        "9:15-10:15 зал",
                        "10:30-11:30 лед",
                    ],
                    "Четверг": [
                        "9:15-10:15 зал",
                        "10:30-11:30 лед",
                    ],
                },
            },
        },
    },
    "arenakharlamova": {
        "Оздоровительные группы": {
            "Дополнительно": "",
            "Погонина А.А.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "17:45-18:45 зал",
                        "19:00-20:00 лёд",
                    ],
                    "Воскресенье": [
                        "14:30-15:30 зал",
                        "15:45-16:45 лед",
                    ],
                },
            },
            "Кузнецова В.М.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "14:30-15:30 зал",
                        "15:45-16:45 лед",
                    ],
                },
            },
        },
        "Группы любителей ": {
            "Дополнительно": "",
            "Цвелиховский В.В.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "18:45-19:45 лед",
                        "20:00-21:00 зал",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "17:45-18:45 лед",
                        "19:00-20:00 зал",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
            "Вязина Е.А.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "17:30-18:30 хореография ",
                        "18:45-19:45 зал",
                        "20:00-21:00 лёд",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лёд",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лёд",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "14:30-15:30 зал",
                        "15:45-16:45 лёд",
                    ],
                },
            },
        },
        "Дети 3 года обучения ": {
            "Дополнительно": "(новичок 3, юный фигурист)",
            "Шишкина П.С.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "18:45-19:45 лед",
                        "20:00-21:00 хореография",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "18:45-19:45 лед",
                        "20:00-21:00 зал",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "18:45-19:45 лед",
                        "20:00-21:00 зал",
                    ],
                    "Суббота": [
                        "17:45-18:45 лед",
                        "19:00-20:00 зал",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
            "Попова Е.А.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "18:45-19:45 лед",
                        "20:00-21:00 хореография",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "18:45-19:45 лед",
                        "20:00-21:00 зал",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "18:45-19:45 лед",
                        "20:00-21:00 зал",
                    ],
                    "Суббота": [
                        "17:45-18:45 лед",
                        "19:00-20:00 зал",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
        "Юношеские разряды ": {
            "Дополнительно": "",
            "Цвелиховский В.В.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "18:45-19:45 лед",
                        "20:00-21:00 зал",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "18:45-19:45 лед",
                        "20:00-21:00 зал",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "14:30-15:30 зал",
                        "15:45-16:45 лед",
                    ],
                },
            },
        },
        "Новый набор": {
            "Дополнительно": "",
            "Соколова Д.С.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "18:45-19:45 лед",
                        "20:00-21:00 зал",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "14:30-15:30 зал",
                        "15:45-16:45 лед",
                    ],
                },
            },
        },
    },
    "arenarocket": {
        "Оздоровительная группа ": {
            "Дополнительно": "",
            "Занина А.И.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "18:15-19:15 зал",
                        "19:30-20:30 лед",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "10:45-11:45 лед",
                        "12:00-13:00 зал",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
            "Сивкова С.В.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "18:15-19:15 зал",
                        "19:30-20:30 лед",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "9:30-10:30 лёд",
                        "10:45-11:45 зал",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
        "Группа набора ": {
            "Дополнительно": "",
            "Филева А.П.": {
                "Дополнительно": "3-6 лет",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "18:15-19:15 зал",
                        "19:30-20:30 лед",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "9:30-10:30 лед",
                        "10:45-11:45 зал",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
        "Группа 2 года обучения ": {
            "Дополнительно": "(новичок 1, новичок 2)",
            "Филева А.П.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "18:15-19:15 зал",
                        "19:30-20:30 лед",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "18:15-19:15 зал",
                        "19:30-20:30 лед",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
        "Группа 3 года обучения ": {
            "Дополнительно": "",
            "Занина А.И.": {
                "Дополнительно": "4-6 лет",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "18:15-19:15 зал",
                        "19:30-20:30 лед",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "18:15-19:15 зал",
                        "19:30-20:30 лед",
                    ],
                    "Суббота": [
                        "9:30-10:30 лед",
                        "10:45-11:45 хореография",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
        "Юношеские разряды": {
            "Дополнительно": "",
            "Назарова Е.А.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "18:15-19:15 зал",
                        "19:30-20:30 лед",
                    ],
                    "Среда": [
                        "18:15-19:15 зал",
                        "19:30-20:30 лед",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "18:15-19:15 зал",
                        "19:30-20:30 лед",
                    ],
                    "Суббота": [
                        "10:45-11:45 лед",
                        "12:00-13:00 хореография",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
        "Группа любителей": {
            "Дополнительно": "",
            "Цвелиховский В.В.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "9:30-10:30 лед",
                        "10:45-11:45 зал",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
    },
    "strelna": {
        "Оздоровительная группа": {
            "Дополнительно": "",
            "Волкова С.А.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
        "Группа 2 года обучения ": {
            "Дополнительно": "(новичок 1, новичок 2)",
            "Онищенко С.А.": {
                "Дополнительно": "4-6 лет",
                "Расписание": {
                    "Понедельник": [
                        "(Рубеж)",
                        "18:45-19:45 хореография",
                        "20:00-21:00 лед (4 раз)",
                    ],
                    "Вторник": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "(Рубеж)",
                        "9:00-9:45 зал",
                        "10:00-11:00 лед",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
        "Группа 3 года обучения": {
            "Дополнительно": "(новичок 3, юный фигурист)",
            "Сорокина Е.А.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед (третий раз)",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
        "Группа набора ": {
            "Дополнительно": "(без подготовки)",
            "Чернова Р.А.": {
                "Дополнительно": "3-4 года",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лёд",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лёд",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
            "Онищенко С.А.": {
                "Дополнительно": "4-6 лет",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
    },
    "petergof": {
        "Оздоровительная группа": {
            "Дополнительно": "",
            "Волкова С.А.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед",
                    ],
                    "Среда": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
        "Группа 2 года обучения ": {
            "Дополнительно": "(новичок 1, новичок 2)",
            "Борисова С.Н.": {
                "Дополнительно": "4-6 лет",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
        "Группа набора ": {
            "Дополнительно": "(без подготовки)",
            "Борисова С.Н.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
    },
    "redstar": {
        "Спортивные разряды ": {
            "Дополнительно": "",
            "Петрова Е.В.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "18:30-19:30 лед",
                        "19:45-20:45 зал",
                    ],
                    "Среда": [
                        "18:30-19:30 лед",
                        "19:45-20:45 зал",
                    ],
                    "Пятница": [
                        "18:45-19:45 лед",
                        "20:00-21:00 зал",
                    ],
                    "Суббота": [
                        "9:15-10:15 лед",
                        "10:30-11:30 зал",
                    ],
                },
            },
        },
        "Юношеские разряды": {
            "Дополнительно": "",
            "Серова А.С.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "18:30-19:30 лед",
                        "19:45-20:45 зал",
                    ],
                    "Среда": [
                        "18:30-19:30 лед",
                        "19:45-20:45 зал",
                    ],
                    "Пятница": [
                        "18:45-19:45 лед",
                        "20:00-21:00 зал",
                    ],
                    "Воскресенье": [
                        "9:30-10:30 лед",
                        "10:45-11:45 зал",
                    ],
                },
            },
            "Доронина С.И.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "18:30-19:30 лед",
                        "19:45-20:45 зал",
                    ],
                    "Среда": [
                        "18:30-19:30 лед",
                        "19:45-20:45 зал",
                    ],
                    "Суббота": [
                        "9:15-10:15 лед",
                        "10:30-11:30 зал",
                    ],
                },
            },
        },
        "Группа 2 года обучения ": {
            "Дополнительно": "(новичок 1, новичок 2)",
            "Катичев В.О": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "18:30-19:30 лед",
                        "19:45-20:45 зал",
                    ],
                    "Пятница": [
                        "18:45-19:45 лед",
                        "20:00-21:00 зал",
                    ],
                },
            },
        },
        "Оздоровительная группа": {
            "Дополнительно": "",
            "Цвелиховский В.В..": {
                "Дополнительно": "",
                "Расписание": {
                    "Воскресенье": [
                        "9:30-10:30 лед",
                        "10:45-11:45 зал",
                    ],
                },
            },
        },
        "Группа набора ": {
            "Дополнительно": "(без подготовки)",
            "Тырлова Т.А.": {
                "Дополнительно": "",
                "Расписание": {
                    "Среда": [
                        "18:30-19:30 лед",
                        "19:45-20:45 зал",
                    ],
                    "Суббота": [
                        "9:15-10:15 лед",
                        "10:30-11:30 зал",
                    ],
                },
            },
        },
    },
    "shuvalovskyarena": {
        "Группы 2 год обучения": {
            "Дополнительно": "(Новичок 1, Новичок 2)",
            "Сластина Е.Л.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "18:15-19:15 зал",
                        "19:30-20:30 лед",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед",
                    ],
                    "Суббота": [
                        "12:15-13:15 зал",
                        "13:30-14:30 лёд",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
            // "Кочина А.А.": {
            //     "Дополнительно": "",
            //     "Расписание": {
            //         "Понедельник": [
            //             "",
            //         ],
            //         "Вторник": [
            //             "9.30-10.30 лёд",
            //             "10.45-11.45 зал",
            //         ],
            //         "Среда": [
            //             "",
            //         ],
            //         "Четверг": [
            //             "9.30-10.30 лёд",
            //             "10.45-11.45 зал",
            //         ],
            //         "Пятница": [
            //             "",
            //         ],
            //         "Суббота": [
            //             "",
            //             "Занятия проходят на Айсбург арене",
            //         ],
            //         "Воскресенье": [
            //             "",
            //         ],
            //     },
            // },
        },

        "Группа набора ": {
            "Дополнительно": "",
            "Никитина Д.А.": {
                "Дополнительно": "3-6 лет",
                "Расписание": {
                    "Понедельник": [
                        "18:15-19:15 зал",
                        "19:30-20:30 лед"
                    ],
                    "Четверг": [
                        "17:45-18:45 лед",
                        "19:00-20:00 зал"
                    ],
                    "Суббота": [
                        "14:45-15:45 зал",
                        "16:00-17:00 лед"
                    ]
                }
            },
            "Чумарина В.В.": {
                "Дополнительно": "3-6 лет",
                "Расписание": {
                    "Понедельник": [
                        "18:15-19:15 зал",
                        "19:30-20:30 лед"
                    ],
                    "Пятница": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед"
                    ],
                    "Суббота": [
                        "12:15-13:15 зал",
                        "13:30-14:30 лед"
                    ]
                }
            },
            "Зарипова А.А.": {
                "Дополнительно": "3-6 лет",
                "Расписание": {
                    "Вторник": [
                        "18:45-19:45 зал",
                        "19:30-20:30 лед"
                    ],
                    "Четверг": [
                        "17:45-18:45 лед",
                        "19:00-20:00 зал"
                    ],
                    "Суббота": [
                        "12:15-13:15 зал",
                        "13:30-14:30 лед"
                    ]
                }
            },
            "Мамонтова А.С.": {
                "Дополнительно": "7-9 лет",
                "Расписание": {
                    "Вторник": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед"
                    ],
                    "Четверг": [
                        "17:45-18:45 лед",
                        "19:00-20:00 зал"
                    ],
                    "Суббота": [
                        "14:45-15:45 зал",
                        "16:00-17:00 лед"
                    ]
                }
            },
            "Березкина К.С.": {
                "Дополнительно": "7-9 лет",
                "Расписание": {
                    "Понедельник": [
                        "18:15-19:15 зал",
                        "19:30-20:30 лед"
                    ],
                    "Пятница": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед"
                    ]
                }
            }
        },
        "Группы любителей ": {
            "Дополнительно": "",
            "Никитина Д.А.": {
                "Дополнительно": "10-15 лет",
                "Расписание": {
                    "Вторник": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед"
                    ],
                    "Пятница": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед"
                    ]
                }
            },
            "Сластина Е.Л.": {
                "Дополнительно": "3 год обучения",
                "Расписание": {
                    "Суббота": [
                        "14:45-15:45 зал",
                        "16:00-17:00 лед"
                    ]
                }
            },
            "Жужгина А.В.": {
                "Дополнительно": "взрослые любители",
                "Расписание": {
                    "Вторник": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед"
                    ],
                    "Суббота": [
                        "14:45-15:45 зал",
                        "16:00-17:00 лед"
                    ]
                }
            },
            "Кочанова С.О.": {
                "Дополнительно": "взрослые любители",
                "Расписание": {
                    "Понедельник": [
                        "18:15-19:15 зал",
                        "19:30-20:30 лед"
                    ],
                    "Пятница": [
                        "18:45-19:45 зал",
                        "20:00-21:00 лед"
                    ]
                }
            }
        }
    },
    "parnasarena": {
        "Спортивные разряды": {
            "Дополнительно": "",
            "Зарипова А.А.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "18:30-19:30 сфп/офп",
                        "19:45-20:45 лед",
                    ],
                    "Вторник": [
                        "17:30-18:30 хореография",
                        "18:45-19:45 лед  20:00-21:00 офп/растяжка",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "17:30-18:30 сфп/офп",
                        "18:45-19:45 лед  20:00-21:00 хореография",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "10:45-11:45 лед",
                        "12:00-13:00 сфп/офп",
                        "14:00-15:00 танцы",
                        "15:15-16:15 лед",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
        "Оздоровительная группа ": {
            "Дополнительно": "",
            "Погонина А.А.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "17:30-18:30 сфп/офп",
                        "18:45-19:45 лед",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "14:00-15:00 сфп/офп",
                        "15:15-16:15 лед",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
            "Бабушкина В.В.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "17:30-18:30 офп",
                        "18:45-19:45 лед",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "10:45-11:45 лед",
                        "12:00-13:00 офп",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
        "Новый набор ": {
            "Дополнительно": "",
            "Погонина А.А.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "17:30-18:30 офп",
                        "18:45-19:45 лед",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "10:45-11:45 лед",
                        "12:00-13:00 офп",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
            "Бабушкина В.В. ": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "18:30-19:30 офп",
                        "19:45-20:45 лед",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "17:30-18:30 сфп/офп",
                        "18:45-19:45 лед",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
        "Группа любителей": {
            "Дополнительно": "",
            "Буржинскайте В.А.": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "18:30-19:30 офп",
                        "19:45-20:45 лед",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "17:30-18:30 сфп/офп",
                        "18:45-19:45 лед",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
    },
    "repinoarena": {
        "Спортивные разряды ": {
            "Дополнительно": "",
            "Сагутдинов Ю.Р. / Жунгиету Ю.И.": {
                "Дополнительно": "2016-2013 г.р.",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "18:00 зал ",
                        "19:15 лед ",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "17:30 лед",
                        "18:45 зал",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
        "Юношеские разряды": {
            "Дополнительно": "",
            "Сагутдинов Ю.Р. / Жунгиету Ю.И.": {
                "Дополнительно": "2016-2014 г.р.",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "18:00 зал ",
                        "19:15 лед ",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "17:30 лед ",
                        "18:45 зал ",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
        "Новый набор": {
            "Дополнительно": "",
            "Федькина С.О.": {
                "Дополнительно": "от 3 до 6 лет ",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "18:00 зал ",
                        "19:15 лед ",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "17:30 лед ",
                        "18:45 зал",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
        "Оздоровительная группа ": {
            "Дополнительно": "",
            "Петроченко Д.С.": {
                "Дополнительно": "с 7 до 16 лет ",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "18:00 зал ",
                        "19:15 лед ",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "17:30 лед ",
                        "18:45 зал",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
        "Дети 2 года обучения": {
            "Дополнительно": "",
            "Федькина С.О. ": {
                "Дополнительно": "с 4 до 7 лет",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "18:00 зал",
                        "19:15 лед",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "17:30 лед",
                        "18:45 зал",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
    },
    "TEMPLATE": {
        "Название_группы": {
            "Дополнительно": "",
            "Имя_тренера": {
                "Дополнительно": "",
                "Расписание": {
                    "Понедельник": [
                        "",
                    ],
                    "Вторник": [
                        "",
                    ],
                    "Среда": [
                        "",
                    ],
                    "Четверг": [
                        "",
                    ],
                    "Пятница": [
                        "",
                    ],
                    "Суббота": [
                        "",
                    ],
                    "Воскресенье": [
                        "",
                    ],
                },
            },
        },
    },
}
const abonPrices = {
    "iceburgarena": [
        ["-", "-", "-", "-", "-", "-",], // Утренние абонементы
        ["8000", "12000", "18000", "24000", "31500", "37500",] // Вечерние абонементы
    ],
    "ice3": [
        ["-", "-", "-", "-", "-", "-",], // Утренние абонементы
        ["8000", "12000", "18000", "22400", "29400", "-",] // Вечерние абонементы
    ],
    "border": [
        ["-", "12000", "18000", "-", "-", "-",], // Утренние абонементы
        ["8000", "12800", "19200", "24000", "31500", "37500",] // Вечерние абонементы
    ],
    "arenachance": [
        ["-", "12000", "18000", "-", "-", "-",], // Утренние абонементы
        ["8000", "12800", "19200", "24000", "31500", "37500",] // Вечерние абонементы
    ],
    "arenaneva": [
        ["-", "12000", "18000", "-", "-", "-",], // Утренние абонементы
        ["10000", "14400", "21600", "25600", "31500", "37500",] // Вечерние абонементы
    ],
    "arenakharlamova": [
        ["-", "-", "-", "-", "-", "-",], // Утренние абонементы
        ["8000", "12000", "18000", "24000", "31500", "37500",] // Вечерние абонементы
    ],
    "arenarocket": [
        ["-", "-", "-", "-", "-", "-",], // Утренние абонементы
        ["6000", "10400", "15600", "19200", "-", "-",] // Вечерние абонементы
    ],
    "strelna": [
        ["-", "-", "-", "-", "-", "-",], // Утренние абонементы
        ["8000", "12000", "18000", "22400", "29400", "-",] // Вечерние абонементы
    ],
    "petergof": [
        ["-", "-", "-", "-", "-", "-",], // Утренние абонементы
        ["8000", "12000", "18000", "22400", "29400", "-",] // Вечерние абонементы
    ],
    "redstar": [
        ["-", "-", "-", "-", "-", "-",], // Утренние абонементы
        ["8000", "12000", "18000", "22400", "29400", "-",] // Вечерние абонементы
    ],
    "shuvalovskyarena": [
        ["-", "10400", "15600", "-", "-", "-",], // Утренние абонементы
        ["8000", "12000", "18000", "22400", "29400", "-",] // Вечерние абонементы
    ],
    "repinoarena": [
        ["-", "-", "-", "-", "-", "-",], // Утренние абонементы
        ["8000", "12000", "18000", "24000", "31500", "37500",] // Вечерние абонементы
    ],
    // "parnasarena": [
    //     [ "-", "-", "-", "-", "-", "-", ], // Утренние абонементы
    //     [ "8000", "12000", "18000", "22400", "29400", "-", ] // Вечерние абонементы
    // ],
    "TEMPLATE": [
        [
            "Одноразовый: <br> 4 занятия",
            "2х разовый: <br> 8 занятий",
            "3х разовый: <br> 12 занятий",
            "4х разовый: <br> 16 занятий",
            "5&#8209;и разовый: <br> 21 занятие",
            "6&#8209;и разовый: <br> 25 занятий",], // Утренние абонементы
        ["-", "-", "-", "-", "-", "-",] // Вечерние абонементы
    ],
}
const arenasObject = {
    iceburgarena: {
        name: 'Айсбург',
        address: '',
        link: '/iceburgarena',
        menuName: '"Айсбург" - м. Пионерская/Комендантский',
    },
    ice3: {
        name: 'Лёд-3',
        address: '',
        link: '/ice3',
        menuName: '"Лед-3" - м. Электросила/Московские ворота',
    },
    border: {
        name: 'Рубеж',
        address: '',
        link: '/border',
        menuName: '"Рубеж" - м. пр.Ветеранов',
    },
    arenachance: {
        name: 'Шанс',
        address: '',
        link: '/arenachance',
        menuName: '"Шанс" - м. Лесная',
    },
    arenaneva: {
        name: 'Дальневосточный',
        address: '',
        link: '/arenaneva',
        menuName: '«Нева (Дальневосточный)»',
    },
    arenakharlamova: {
        name: 'Харламова',
        address: '',
        link: '/arenakharlamova',
        menuName: '"Ак. Харламова" - м. Бухарестская/Международная\n',
    },
    arenarocket: {
        name: 'Ракета',
        address: '',
        link: '/arenarocket',
        menuName: '"Ракета" - п. Шушары',
    },
    strelna: {
        name: 'Стрельна',
        address: '',
        link: '/strelna',
        menuName: '"Стрельна" - п. Стрельна',
    },
    petergof: {
        name: 'Петергоф',
        address: '',
        link: '/petergof',
        menuName: '"Петергоф" - г. Петергоф',
    },
    redstar: {
        name: 'Красная звезда',
        address: '',
        link: '/redstar',
        menuName: '"Красная звезда" - м. Ладожская/ пр.Большевиков',
    },
    shuvalovskyarena: {
        name: 'Шуваловский лёд',
        address: '',
        link: '/shuvalovskyarena',
        menuName: '"Шуваловский лед" - м. Комендантский пр./Озерки',
    },
    repinoarena: {
        name: 'Репино',
        address: '',
        link: '/repinoarena',
        menuName: 'ЗК «Репино - Ленинское»',
    },
    // parnasarena: {
    //     name: 'Парнас',
    //     address: '',
    //     link: '',
    //     menuName: '',
    //     },
}

const renderWeek = (arena) => {
    const block = document.querySelector(`[data-arena-name="${arena}"].scheduleWeek`)
    block.insertAdjacentHTML("beforeend", `<section></section>`)
    const table = block.querySelector('section')
    for (const day of Object.entries(scheduleWeek[arena])) {
        if (day[1].length > 1) {
            table.insertAdjacentHTML('beforeend', `<div data-day="${day[0]}"><div>${day[0]}</div></div>`)
            table.querySelector(`[data-day="${day[0]}"]`).insertAdjacentHTML('beforeend', `<section></section>`)
            for (let i = 0; i < day[1].length; i++) {
                table.querySelector(`[data-day="${day[0]}"] section`).insertAdjacentHTML('beforeend', `<div>${day[1][i]}</div>`)
            }
        }
    }
}
const renderWeekSections = document.querySelectorAll('.scheduleWeek')

const renderSeason = (arena) => {
    const block = document.querySelector(`[data-arena-name="${arena}"].scheduleSeason`)
    block.insertAdjacentHTML('beforeend', `<section class="arena-filters"></section><section class="arena-filters-schedule"></section>`)
    const filterBlock = block.querySelector('.arena-filters')
    const filterSchedule = block.querySelector('.arena-filters-schedule')

    for (const group of Object.entries(scheduleSeason[arena])) {
        const groupName = group[0] // Название группы
        const groupObj = group[1] // Объект группы внутри арены
        const groupMoreInfo = groupObj["Дополнительно"]; // Доп. инфа, есть не всегда

        // Создаем 2 секции. Для кнопок фильтров и для расписаний
        filterBlock.insertAdjacentHTML('beforeend', `<button onclick="filterSeason('${groupName}')" data-button="${groupName}">${groupName}</button>`)
        filterSchedule.insertAdjacentHTML('beforeend', `<section data-group-name="${groupName}"></section>`)
        const groupBlock = document.querySelector(`[data-group-name="${groupName}"]`)

        // Рендер названия группы и доп. инфы ( при наличии )
        groupMoreInfo ? groupBlock.insertAdjacentHTML('beforeend', `<p>${groupMoreInfo}</p>`) : ''

        // Работаем с объектом тренеров
        for (const coach of Object.entries(scheduleSeason[arena][groupName])) {
            const coachName = coach[0] // Имя тренера
            const coachObj = coach[1] // Объект расписаний внутри тренера
            const coachMoreInfo = coachObj["Дополнительно"]; // Доп. инфа, есть не всегда


            if (coachName !== 'Дополнительно') {
                // Создаем секции с тренерами
                groupBlock.insertAdjacentHTML('beforeend', `<section data-coach-name="${coachName}"><p>${coachName}</p></section>`)
                const coachSection = groupBlock.querySelector(`[data-coach-name="${coachName}"]`)
                coachMoreInfo ? coachSection.insertAdjacentHTML('beforeend', `<p>${coachMoreInfo}</p>`) : ''

                const coachSchedule = coachObj["Расписание"]

                for (const day of Object.entries(coachSchedule)) {
                    const dayName = day[0]
                    const daySchedules = day[1]

                    // Создаем секцию с расписанием на день
                    if (day[1].length > 1) {
                        coachSection.insertAdjacentHTML('beforeend', `<section data-coach-day="${dayName}"><p>${dayName}</p></section>`)
                        const daySection = coachSection.querySelector(`[data-coach-day="${dayName}"]`)

                        daySchedules.forEach(daySchedule => {
                            daySection.insertAdjacentHTML('beforeend', `<p>${daySchedule}</p>`)
                        })
                    }
                }
            }
        }
    }
}
const renderSeasonSections = document.querySelectorAll('.scheduleSeason')
const filterSetup = () => {
    try {
        const buttons = document.querySelectorAll('.arena-filters > [data-button]')
        const groups = document.querySelectorAll('.arena-filters-schedule > [data-group-name]')
        if (buttons && groups) {
            buttons[0].classList.toggle('active')
            filterSeason(buttons[0].textContent, true)
        }
    } catch (e) {
        console.log(e.message)
    }
}
const filterSeason = (groupName, firstSetup = false) => {
    const buttons = document.querySelectorAll('.arena-filters > button')
    const groups = document.querySelectorAll('.arena-filters-schedule > [data-group-name]')

    buttons.forEach(button => {
        if (button.textContent !== groupName) {
            button.classList.remove('active')
        } else button.classList.add('active')
    })
    groups.forEach(group => {
        if (group.getAttribute('data-group-name') !== groupName) {
            group.classList.remove('active')
        } else {
            group.classList.add('active')
            !firstSetup ? group.scrollIntoView({behavior: 'smooth', block: 'nearest'}) : ''
        }
    })
}

const abonPricesSections = document.querySelectorAll('.abonPrices')

const renderByTiming = (sectionName) => {
    const section = document.querySelector(`[data-arena-name="${sectionName}"]`)
    const tickets = abonPrices["TEMPLATE"][0]
    const removeEmpty = () => {
        const abons = document.querySelectorAll('[data-ticket]')
        abons.forEach(abon => {
            if (!abon.querySelector('div')) {
                abon.remove()
            }
        })
    }
    const insertPrice = (index) => {
        let list = ''
        if (sectionName === 'all-evening') {
            for (const [name, value] of Object.entries(abonPrices)) {
                if (name === 'TEMPLATE' || value[1][index] === '-') continue
                const realName = arenasObject[name].name
                list = list + (`<div>${realName}<span> - ${value[1][index]}</span></div>`)
            }
        }
        if (sectionName === 'all-morning') {
            for (const [name, value] of Object.entries(abonPrices)) {
                if (name === 'TEMPLATE' || value[0][index] === '-') continue
                const realName = arenasObject[name].name
                list = list + (`<div>${realName}<span> - ${value[0][index]}</span></div>`)
            }
        }
        if (list) return list; else return ''
    }
    tickets.forEach((ticket, index) => {
        section.insertAdjacentHTML('beforeend',
            `<div data-ticket="${ticket}">
            <article>${ticket}</article>
            ${insertPrice(index)}
            </div>`
        )
    });
    removeEmpty()
}
renderWeekSections.forEach(section => {
    renderWeek(section.getAttribute('data-arena-name'))
})
renderSeasonSections.forEach(section => {
    renderSeason(section.getAttribute('data-arena-name'))
})
abonPricesSections.forEach(section => {
    const arenaName = section.getAttribute('data-arena-name')
    if (arenaName === 'all-evening' || arenaName === 'all-morning') return renderByTiming(arenaName)

    const arenaData = abonPrices[arenaName]
    const variants = abonPrices["TEMPLATE"][0]

    for (let i = 0; i < variants.length; i++) {
        section.insertAdjacentHTML('beforeend', `<div>
                <article>${variants[i]}</article>
                <div>Вечер: ${arenaData[1][i]}</div>
                <div>Утро: ${arenaData[0][i]}</div>
            </div>`)
    }
})

const menuIs = document.querySelector("#goldenHero menu li ul");
for (const [key, value] of Object.entries(arenasObject)) {
    const {name, address, link, menuName} = value
    if (menuIs) {
        menuIs.insertAdjacentHTML("beforeend", `<li><a href="${link}">${name}</a></li>`)
    }
}

//
document.addEventListener("DOMContentLoaded", filterSetup)