const place = {
    title: '🏖 ЛЕТНИЕ СБОРЫ 🏝',
    address: 'г. ВАЛДАЙ, ЛК «Кристалл», Молодёжная ул., 5',
    dates: 'с 17 по 30 июля 2025 г.',
    cover: 'https://static.tildacdn.com/tild3431-3236-4739-b434-323262346666/NAT_0001.jpg',
}
const gatherings = [
    {
        title: 'СБОР 1',
        whoIsItFor: 'Юношеские и спортивные разряды',
        program: [
            'Лёд 2 часа 30 минут',
            'Зал 1 час 15 минут (Офп, сфп)',
            'Зал 1 час (хореография, танцы)',
        ],
        prices: {
            before: '75.000',
            after: '90.000'
        }
    },
    {
        title: 'СБОР 2',
        whoIsItFor: 'Новички, юный фигурист',
        program: [
            'Лёд 1 час 15 минут',
            'Зал 1 час (сфп, Офп)',
            'Зал 1 час (танцы, хореография)',
        ],
        prices: {
            before: '59.000',
            after: '70.800',
        }
    }
]
const hotels = [
    {
        title: 'АМАКС Валдайские Зори',
        phone: '8 (816) 662-43-63',
        photos: 'https://g.co/kgs/aNB21gm',
        gallery: [
            '',
        ]
    },
    {
        title: 'Гостиница визит-центра национального парка "Валдайский"',
        phone: '8 (981) 602-71-02',
        photos: 'https://g.co/kgs/yfq8w2s',
        gallery: [
            '',
        ]
    },
]